/*
 * (C) 2010-2013 Clemson University and Omnibond Systems, LLC
 *
 * See COPYING in top-level directory.
 */

/* 
 * Dokan is a user-mode file system API like FUSE: http://dokan-dev.net/en/.
 * Most of the following functions are callbacks. dokan_loop starts the
 * Dokan thread. Functions are called as needed by Dokan (responding to
 * file system requests). 
 */

#include <Windows.h>
#include <AccCtrl.h>
#include <AclAPI.h>
#include <stdio.h>
#include <stdlib.h>
#include <time.h>

#include "dokan.h"

#include "pvfs2.h"
#include "gossip.h"
#include "gen-locks.h"
#include "str-utils.h"
#include "security-util.h"

#include "client-service.h"
#include "fs.h"
#include "cert.h"
#include "user-cache.h"
#include "ldap-support.h"
#include "cred.h"
#include "io-cache.h"

BOOL g_UseStdErr;
BOOL g_DebugMode;

/* normally on; disable only for testing */
#define USE_IO_CACHE

extern struct qlist_head user_list;

struct context_entry
{
    struct qhash_head hash_link;
    ULONG64 context;
	DWORD flags;
    PVFS_credential credential;
};

struct qhash_table *context_cache;
gen_mutex_t context_cache_mutex;
extern struct qhash_table *user_cache;
extern PORANGEFS_OPTIONS goptions;

#define DEBUG_FLAG(val, flag) if (val&flag) { client_debug("   "#flag"\n"); }

#define DEBUG_FILE_INFO(p, i) client_debug("   "#i": %u\n", p->i)

#define MALLOC_CHECK(ptr)   if (ptr == NULL) \
                                return -ERROR_NOT_ENOUGH_MEMORY
#define MALLOC_CHECK_N(ptr) if (ptr == NULL) \
                                return NULL

#define CRED_CHECK(func, err)  do { \
                                   if (err != 0) { \
                                       client_debug("%s: bad credential (%d)\n", func, err); \
                                       return err; \
                                   } \
                               } while (0)

#define DEBUG_PATH(path)   client_debug("   resolved path: %s\n", path)

#define DEBUG_BUF_SIZE    8192
void client_debug(char *format, ...)
{
    if (g_DebugMode) 
    {
        char buffer[DEBUG_BUF_SIZE];        
        va_list argp;

        va_start(argp, format);
        vsnprintf_s(buffer, sizeof(buffer), _TRUNCATE, format, argp);
        buffer[DEBUG_BUF_SIZE-1] = '\0';
        va_end(argp);

#ifdef _DEBUG
        /* debug to debugger window */
        OutputDebugString(buffer);
#endif        
        /* use gossip to debug to file or stderr (set in config file) */
        gossip_debug(GOSSIP_WIN_CLIENT_DEBUG, "%s", buffer);
    }
}

/* map a file system error code to a Dokan/Windows code 
   -1 is used as a default error */
static int error_map(int fs_err)
{
    switch (fs_err)
    {
    case 0:
        return ERROR_SUCCESS;         /* 0 */
    case -PVFS_EPERM:          /* Operation not permitted */
    case -PVFS_EACCES:         /* Access not allowed */
        return -ERROR_ACCESS_DENIED;  /* 5 */
    case -PVFS_ENOENT:         /* No such file or directory */
        return -ERROR_FILE_NOT_FOUND;  /* 2 */
    case -PVFS_EINTR:          /* Interrupted system call */
        return -1;
    case -PVFS_EIO:            /* I/O error */
        return -1;
    case -PVFS_ENXIO:          /* No such device or address */
        return -ERROR_DEV_NOT_EXIST;  /* 110 */
    case -PVFS_EBADF:          /* Bad file number */
        return -ERROR_INVALID_HANDLE; /* 6 */
    case -PVFS_EAGAIN:         /* Try again */
        return -1;
    case -PVFS_ENOMEM:         /* Out of memory */
        return -ERROR_NOT_ENOUGH_MEMORY;  /* 8 */
    case -PVFS_EFAULT:         /* Bad address */
        return -ERROR_INVALID_ADDRESS;  /* 487 */
    case -PVFS_EBUSY:          /* Device or resource busy */
        return -ERROR_BUSY;              /* 170 */
    case -PVFS_EEXIST:         /* File exists */
        return -ERROR_ALREADY_EXISTS;    /* 183 */
    case -PVFS_ENODEV:         /* No such device */
        return -ERROR_DEV_NOT_EXIST;     /* 55 */
    case -PVFS_ENOTDIR:        /* Not a directory */
        return -ERROR_DIRECTORY;         /* 267 */
    case -PVFS_EISDIR:         /* Is a directory */
        return -ERROR_DIRECTORY;         /* 267 */
    case -PVFS_EINVAL:         /* Invalid argument */
        return -ERROR_INVALID_PARAMETER; /* 87 */
    case -PVFS_EMFILE:         /* Too many open files */
        return -ERROR_TOO_MANY_OPEN_FILES;  /* 4 */
    case -PVFS_EFBIG:          /* File too large */
        return -ERROR_FILE_TOO_LARGE;       /* 223 */
    case -PVFS_ENOSPC:         /* No space left on device */
        return -ERROR_HANDLE_DISK_FULL;     /* 39 */
    case -PVFS_EROFS:          /* Read-only file system */
        return -ERROR_NOT_SUPPORTED;        /* 50 */
    case -PVFS_EMLINK:         /* Too many links */
        return -ERROR_TOO_MANY_LINKS;       /* 1142 */
    case -PVFS_EPIPE:          /* Broken pipe */
        return -ERROR_BROKEN_PIPE;          /* 109 */
    case -PVFS_EDEADLK:        /* Resource deadlock would occur */
        return -ERROR_POSSIBLE_DEADLOCK;    /* 1131 */
    case -PVFS_ENAMETOOLONG:   /* File name too long */
        return -ERROR_BUFFER_OVERFLOW;      /* 111 */
    case -PVFS_ENOLCK:         /* No record locks available */
        return -ERROR_LOCK_FAILED;          /* 167 */
    case -PVFS_ENOSYS:         /* Function not implemented */
        return -ERROR_CALL_NOT_IMPLEMENTED; /* 120 */
    case -PVFS_ENOTEMPTY:      /* Directory not empty */
        return -ERROR_DIR_NOT_EMPTY;        /* 145 */
    case -PVFS_ELOOP:          /* Too many symbolic links encountered */
        return -ERROR_TOO_MANY_LINKS;       /* 1142 */
    case -PVFS_EWOULDBLOCK:    /* Operation would block */
        return -WSAEWOULDBLOCK;             /* 10035 */
    case -PVFS_ENOMSG:         /* No message of desired type */
        return -ERROR_INVALID_MESSAGE;      /* 1002 */
    case -PVFS_EUNATCH:        /* Protocol driver not attached */
        return -ERROR_FS_DRIVER_REQUIRED;   /* 588 */
    case -PVFS_EBADR:          /* Invalid request descriptor */
    case -PVFS_EDEADLOCK:      /* Deadlock would result */
        return -ERROR_POSSIBLE_DEADLOCK;    /* 1131 */
    case -PVFS_ENODATA:        /* No data available */
        return -ERROR_NO_DATA;              /* 232 */
    case -PVFS_ETIME:          /* Timer expired */
        return -ERROR_TIMEOUT;              /* 1460 */
    case -PVFS_ENONET:         /* Machine is not on the network */
        return -ERROR_NO_NETWORK;           /* 1222 */
    case -PVFS_EREMOTE:        /* Object is remote */
        return -1;          
    case -PVFS_ECOMM:          /* Communication error on send */
        return -1;
    case -PVFS_EPROTO:         /* Protocol error */
        return -1;
    case -PVFS_EBADMSG:        /* Not a data message */
        return -ERROR_INVALID_MESSAGE;      /* 1002 */      
    case -PVFS_EOVERFLOW:      /* Value too large for defined data type */
        return -ERROR_BUFFER_OVERFLOW;      /* 111 */
    case -PVFS_ERESTART:       /* Interrupted system call should be restarted */
        return -1;
    case -PVFS_EMSGSIZE:       /* Message too long */
        return -WSAEMSGSIZE;                /* 10040 */
    case -PVFS_EPROTOTYPE:     /* Protocol wrong type for socket */
        return -WSAEPROTOTYPE;              /* 10041 */
    case -PVFS_ENOPROTOOPT:    /* Protocol not available */
        return -WSAENOPROTOOPT;             /* 10042 */
    case -PVFS_EPROTONOSUPPORT:/* Protocol not supported */
        return -WSAEPROTONOSUPPORT;         /* 10043 */
    case -PVFS_EOPNOTSUPP:     /* Operation not supported on transport endpoint */
        return -WSAEOPNOTSUPP;              /* 10045 */
    case -PVFS_EADDRINUSE:     /* Address already in use */
        return -WSAEADDRINUSE;              /* 10048 */
    case -PVFS_EADDRNOTAVAIL:  /* Cannot assign requested address */
